org/reports/2019-08-19_update.org
#+TITLE: APISnoop Update for 19 August 2019
#+NOSETUPFILE: ../org-templates/level-0.org
#+SETUPFILE_CALLS: .dir-locals.el twice for a single file
#+PROPERTY: header-args :eval never-export
#+PROPERTY: header-args:shell :eval never-export :results output verbatim replace drawer :exports both
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t c:nil
#+OPTIONS: creator:comment d:(not LOGBOOK) date:t e:t email:nil f:t inline:t
#+OPTIONS: num:nil p:nil pri:nil stat:t tags:t tasks:t tex:t timestamp:t toc:nil
#+OPTIONS: todo:t |:t
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+OPTIONS: html-postamble:nil html-preamble:t tex:t
#+CREATOR: <a href='https://ii.coop'>The ii team</a> 
#+HTML_CONTAINER: div
#+HTML_DOCTYPE: xhtml-strict
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="aesthetic/main.css" />
#+HTML_HEAD_EXTRA: <link href="https://fonts.googleapis.com/css?family=Fira+Sans:300,300i,400,400i,700" rel="stylesheet">
#+HTML_HTML5_FANCY:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+INFOJS_OPT:
#+AUTHOR: ii team
#+DATE: 2019-08-19
#+PROPERTY: header-args :exports both :eval never-export

* Summary  
The APISnoop team are working to expand how much one can know about field usage and coverage in Kubernetes.  Our initial question was “What is the state of testing coverage for every field related to PodSpec?” This question required us to first discover which fields actually relate to PodSpec and in what configuration, and how to correlate the data within Audit Log events to the corresponding fields and definitions within the swagger.json.

  Our work to answer this question is helping to answer the larger questions like, "what is the testing coverage for every field?   “Or for any arbitrary kind, what fields relate to it and what are their coverage?”
  
  The APISnoop team are working to expand how much we know, or can know, about field usage and coverage in Kubernetes.  Our initial question to answer was: “What is the state of testing coverage for every field related to PodSpec”. This question required us to first discover which fields actually relate to PodSpec and in what configuration, and how to correlate the data within Audit Log events to the corresponding fields and definitions within the swagger.json.
  
  We are working within a new infrastructure for APISnoop, where we load audit events and swaggers directly into a Postgres database, and then build out our queries from this raw data.  This allows us to query the data from multiple sources, including this report: all tables listed below are coming directly from our server, by running queries dynamically as we type this report.
* PodSpec Field Coverage
  
 Initially we explored podspec coverage by giving a report on each field related to podspec and its relative hits, test hits, and conformance test hits.  We did this by manually walking the podspec tree to get all relevant fields, then building out a custom view.
 
#+NAME: PodSpec Field Coverage
#+BEGIN_SRC sql-mode :exports both :eval never-export :results value raw drawer
select * from podspec_field_summary;
#+END_SRC

#+CAPTION: PodSpec Field Coverage
  |         podspec_field         | other_hits | e2e_hits | conf_hits|  
  |-------------------------------+------------+----------+----------|
  | ephemeralContainers           |          0 |        0 |         0|
  | overhead                      |          0 |        0 |         0|
  | preemptionPolicy              |          0 |        0 |         0|
  | shareProcessNamespace         |          0 |        0 |         0|
  | topologySpreadConstraints     |          0 |        0 |         0|
  | readinessGates                |          0 |        8 |         0|
  | dnsConfig                     |          0 |       16 |         0|
  | hostIPC                       |          0 |       16 |         0|
  | hostPID                       |          0 |       16 |         0|
  | priorityClassName             |       3731 |       32 |         0|
  | runtimeClassName              |          0 |       36 |         0|
  | affinity                      |       1213 |       43 |         0|
  | hostAliases                   |          0 |        0 |         8|
  | imagePullSecrets              |          0 |        0 |         8|
  | activeDeadlineSeconds         |         18 |        8 |        14|
  | initContainers                |          0 |     1315 |        32|
  | hostNetwork                   |       2687 |     1574 |        41|
  | automountServiceAccountToken  |          0 |       36 |        60|
  | subdomain                     |       5253 |       85 |        60|
  | hostname                      |       5469 |       85 |        60|
  | priority                      |        900 |       83 |       105|
  | tolerations                   |       4820 |       83 |       105|
  | nodeName                      |       8379 |     4170 |       127|
  | nodeSelector                  |       3260 |      257 |       128|
  | serviceAccount                |      12025 |     1199 |       201|
  | serviceAccountName            |      12025 |     1199 |       201|
  | volumes                       |      15598 |     6903 |       876|
  | enableServiceLinks            |      12097 |     6506 |      1741|
  | containers                    |      27717 |    13194 |      2063|
  | dnsPolicy                     |      27717 |    13194 |      2063|
  | restartPolicy                 |      27717 |    13194 |      2063|
  | schedulerName                 |      27717 |    13194 |      2063|
  | securityContext               |      27717 |    13194 |      2063|
  | terminationGracePeriodSeconds |      27717 |    13194 |      2063|

This was a useful summary, but immediately begged new questions: what's the coverage for all the fields within something like containers?  Can we see this not as a summary, but as a granular walk through each field and sub-field and see each of their coverage?

To answer these, we'd need to make a generalized query that walked the path of any kind, noting every field and sub-field and the path to each.
