www/2019-08-19_update.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-08-21 Wed 01:25 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>APISnoop Update for 19 August 2019</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ii team" />
<link rel="stylesheet" type="text/css" href="aesthetic/main.css" />
<link href="https://fonts.googleapis.com/css?family=Fira+Sans:300,300i,400,400i,700" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">APISnoop Update for 19 August 2019</h1>

<div id="outline-container-orgc730589" class="outline-2">
<h2 id="orgc730589">Summary</h2>
<div class="outline-text-2" id="text-orgc730589">
<p>
The APISnoop team are working to expand how much one can know about field usage and coverage in Kubernetes.  Our initial question was “What is the state of testing coverage for every field related to PodSpec?” This question required us to first discover which fields actually relate to PodSpec and in what configuration, and how to correlate the data within Audit Log events to the corresponding fields and definitions within the swagger.json.
</p>

<p>
Our work to answer this question is helping to answer the larger questions like, &ldquo;what is the testing coverage for every field?   “Or for any arbitrary kind, what fields relate to it and what are their coverage?”
</p>

<p>
The APISnoop team are working to expand how much we know, or can know, about field usage and coverage in Kubernetes.  Our initial question to answer was: “What is the state of testing coverage for every field related to PodSpec”. This question required us to first discover which fields actually relate to PodSpec and in what configuration, and how to correlate the data within Audit Log events to the corresponding fields and definitions within the swagger.json.
</p>

<p>
We are working within a new infrastructure for APISnoop, where we load audit events and swaggers directly into a Postgres database, and then build out our queries from this raw data.  This allows us to query the data from multiple sources, including this report: all tables listed below are coming directly from our server, by running queries dynamically as we type this report.
</p>
</div>
</div>
<div id="outline-container-org34818cd" class="outline-2">
<h2 id="org34818cd">PodSpec Field Coverage</h2>
<div class="outline-text-2" id="text-org34818cd">
<p>
Initially we explored podspec coverage by giving a report on each field related to podspec and its relative hits, test hits, and conformance test hits.  We did this by manually walking the podspec tree to get all relevant fields, then building out a custom view.
</p>

<div class="org-src-container">
<pre class="src src-sql-mode" id="orgc19a44b"><span style="color: #268bd2; font-weight: bold;">select</span> * <span style="color: #268bd2; font-weight: bold;">from</span> podspec_field_summary;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 1:</span> PodSpec Field Coverage</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">podspec_field</th>
<th scope="col" class="org-right">other_hits</th>
<th scope="col" class="org-right">e2e_hits</th>
<th scope="col" class="org-right">conf_hits</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ephemeralContainers</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">overhead</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">preemptionPolicy</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">shareProcessNamespace</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">topologySpreadConstraints</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">readinessGates</td>
<td class="org-right">0</td>
<td class="org-right">8</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">dnsConfig</td>
<td class="org-right">0</td>
<td class="org-right">16</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">hostIPC</td>
<td class="org-right">0</td>
<td class="org-right">16</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">hostPID</td>
<td class="org-right">0</td>
<td class="org-right">16</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">priorityClassName</td>
<td class="org-right">3731</td>
<td class="org-right">32</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">runtimeClassName</td>
<td class="org-right">0</td>
<td class="org-right">36</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">affinity</td>
<td class="org-right">1213</td>
<td class="org-right">43</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">hostAliases</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">imagePullSecrets</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-left">activeDeadlineSeconds</td>
<td class="org-right">18</td>
<td class="org-right">8</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-left">initContainers</td>
<td class="org-right">0</td>
<td class="org-right">1315</td>
<td class="org-right">32</td>
</tr>

<tr>
<td class="org-left">hostNetwork</td>
<td class="org-right">2687</td>
<td class="org-right">1574</td>
<td class="org-right">41</td>
</tr>

<tr>
<td class="org-left">automountServiceAccountToken</td>
<td class="org-right">0</td>
<td class="org-right">36</td>
<td class="org-right">60</td>
</tr>

<tr>
<td class="org-left">subdomain</td>
<td class="org-right">5253</td>
<td class="org-right">85</td>
<td class="org-right">60</td>
</tr>

<tr>
<td class="org-left">hostname</td>
<td class="org-right">5469</td>
<td class="org-right">85</td>
<td class="org-right">60</td>
</tr>

<tr>
<td class="org-left">priority</td>
<td class="org-right">900</td>
<td class="org-right">83</td>
<td class="org-right">105</td>
</tr>

<tr>
<td class="org-left">tolerations</td>
<td class="org-right">4820</td>
<td class="org-right">83</td>
<td class="org-right">105</td>
</tr>

<tr>
<td class="org-left">nodeName</td>
<td class="org-right">8379</td>
<td class="org-right">4170</td>
<td class="org-right">127</td>
</tr>

<tr>
<td class="org-left">nodeSelector</td>
<td class="org-right">3260</td>
<td class="org-right">257</td>
<td class="org-right">128</td>
</tr>

<tr>
<td class="org-left">serviceAccount</td>
<td class="org-right">12025</td>
<td class="org-right">1199</td>
<td class="org-right">201</td>
</tr>

<tr>
<td class="org-left">serviceAccountName</td>
<td class="org-right">12025</td>
<td class="org-right">1199</td>
<td class="org-right">201</td>
</tr>

<tr>
<td class="org-left">volumes</td>
<td class="org-right">15598</td>
<td class="org-right">6903</td>
<td class="org-right">876</td>
</tr>

<tr>
<td class="org-left">enableServiceLinks</td>
<td class="org-right">12097</td>
<td class="org-right">6506</td>
<td class="org-right">1741</td>
</tr>

<tr>
<td class="org-left">containers</td>
<td class="org-right">27717</td>
<td class="org-right">13194</td>
<td class="org-right">2063</td>
</tr>

<tr>
<td class="org-left">dnsPolicy</td>
<td class="org-right">27717</td>
<td class="org-right">13194</td>
<td class="org-right">2063</td>
</tr>

<tr>
<td class="org-left">restartPolicy</td>
<td class="org-right">27717</td>
<td class="org-right">13194</td>
<td class="org-right">2063</td>
</tr>

<tr>
<td class="org-left">schedulerName</td>
<td class="org-right">27717</td>
<td class="org-right">13194</td>
<td class="org-right">2063</td>
</tr>

<tr>
<td class="org-left">securityContext</td>
<td class="org-right">27717</td>
<td class="org-right">13194</td>
<td class="org-right">2063</td>
</tr>

<tr>
<td class="org-left">terminationGracePeriodSeconds</td>
<td class="org-right">27717</td>
<td class="org-right">13194</td>
<td class="org-right">2063</td>
</tr>
</tbody>
</table>

<p>
This was a useful summary, but immediately begged new questions: what&rsquo;s the coverage for all the fields within something like containers?  Can we see this not as a summary, but as a granular walk through each field and sub-field and see each of their coverage?
</p>

<p>
To answer these, we&rsquo;d need to make a generalized query that walked the path of any kind, noting every field and sub-field and the path to each.
</p>
</div>
</div>
