org/reports/2019-08-19_update.org
* Recursive Querying of Kubernetes Schemas
  We achieved this using a recursive view that starts from a swagger.json defition of a kind, then walks through each of its fields, finding any that reference their own schema and then branching out to walk down each of these paths.  
  
  This allows us to now see every field within the swagger.json, the kind it relates to, and any sub-kinds that come from it.  
  This clarity into kinds will help in multiple ways.  By connecting this work to our audit logs, we can start to see coverage field by field, based on any spec or kind we wished.  We can then see exactly which areas are untested, their importance as related to our kind definitions, and write out tests with better focus and priority.
  
  To better illustrate this, we can look at some sample queries.
* Sample Queries
