www/2019-08-19_update.html
<div id="outline-container-org3bd552d" class="outline-2">
<h2 id="org3bd552d">Recursive Querying of Kubernetes Schemas</h2>
<div class="outline-text-2" id="text-org3bd552d">
<p>
We achieved this using a recursive view that starts from a swagger.json defition of a kind, then walks through each of its fields, finding any that reference their own schema and then branching out to walk down each of these paths.  
</p>

<p>
This allows us to now see every field within the swagger.json, the kind it relates to, and any sub-kinds that come from it.  
This clarity into kinds will help in multiple ways.  By connecting this work to our audit logs, we can start to see coverage field by field, based on any spec or kind we wished.  We can then see exactly which areas are untested, their importance as related to our kind definitions, and write out tests with better focus and priority.
</p>

<p>
To better illustrate this, we can look at some sample queries.
</p>
</div>
</div>
