org/reports/2019-08-19_update.org
** A listing of fields related to Podspec
    We can walk up or down a tree for any arbitrary kind, like podspec. 
    
    We can start at the PodSpec kind and see the fields within.
 #+NAME: Left PodSpec
  #+BEGIN_SRC sql-mode :exports both :eval never-export
   select * from kind_field_path
   where field_kind not like 'io%' -- only look at int and string
   and kind like '%PodSpec'
   and field_path like '%.%'
   limit 20;
 #+END_SRC

 #+CAPTION: Fields Within PodSpec
 | kind                       | field_path                            | field_kind | field_type | sub_kind                     |
 |----------------------------+---------------------------------------+------------+------------+------------------------------|
 | io.k8s.api.core.v1.PodSpec | containers.command                    | string     | array      | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | containers.terminationMessagePath     | string     | string     | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | containers.tty                        | integer    | boolean    | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | containers.args                       | string     | array      | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | containers.image                      | string     | string     | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | containers.stdinOnce                  | integer    | boolean    | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | containers.name                       | string     | string     | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | containers.workingDir                 | string     | string     | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | containers.imagePullPolicy            | string     | string     | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | containers.terminationMessagePolicy   | string     | string     | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | containers.stdin                      | integer    | boolean    | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | initContainers.command                | string     | array      | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | initContainers.terminationMessagePath | string     | string     | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | initContainers.tty                    | integer    | boolean    | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | initContainers.args                   | string     | array      | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | initContainers.image                  | string     | string     | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | initContainers.stdinOnce              | integer    | boolean    | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | initContainers.name                   | string     | string     | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | initContainers.workingDir             | string     | string     | io.k8s.api.core.v1.Container |
 | io.k8s.api.core.v1.PodSpec | initContainers.imagePullPolicy        | string     | string     | io.k8s.api.core.v1.Container |
  
  Or we can go in the other direction, and see a sampling of fields that contain podspec.
  
 #+NAME: Right PodSpec
 #+BEGIN_SRC sql-mode :exports both :eval never-export
 select * from kind_field_path
 where field_kind not like 'io%' -- only look at int and string
 and sub_kind like '%PodSpec'
 and field_path like '%.%'
 limit 20;
 #+END_SRC

 #+CAPTION: Fields that Contain Podspec
 | kind                               | field_path                 | field_kind | field_type | sub_kind                   |
 |------------------------------------+----------------------------+------------+------------+----------------------------|
 | io.k8s.api.core.v1.PodTemplateSpec | spec.hostPID               | integer    | boolean    | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.hostIPC               | integer    | boolean    | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.hostname              | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.nodeName              | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.overhead              | integer    | object     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.priority              | integer    | integer    | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.dnsPolicy             | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.subdomain             | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.hostNetwork           | integer    | boolean    | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.nodeSelector          | integer    | object     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.restartPolicy         | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.schedulerName         | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.serviceAccount        | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.preemptionPolicy      | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.runtimeClassName      | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.priorityClassName     | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.enableServiceLinks    | integer    | boolean    | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.serviceAccountName    | string     | string     | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.activeDeadlineSeconds | integer    | integer    | io.k8s.api.core.v1.PodSpec |
 | io.k8s.api.core.v1.PodTemplateSpec | spec.shareProcessNamespace | integer    | boolean    | io.k8s.api.core.v1.PodSpec |

