www/2019-08-19_update.html
<div id="outline-container-org585f4f8" class="outline-2">
<h2 id="org585f4f8">Sample Queries</h2>
<div class="outline-text-2" id="text-org585f4f8">
</div>
<div id="outline-container-orgb34c3c3" class="outline-3">
<h3 id="orgb34c3c3">A listing of fields related to Podspec</h3>
<div class="outline-text-3" id="text-orgb34c3c3">
<p>
We can walk up or down a tree for any arbitrary kind, like podspec. 
</p>

<p>
We can start at the PodSpec kind and see the fields within.
</p>
<div class="org-src-container">
<pre class="src src-sql-mode" id="org7d7cfe5"><span style="color: #268bd2; font-weight: bold;">select</span> * <span style="color: #268bd2; font-weight: bold;">from</span> kind_field_path
<span style="color: #268bd2; font-weight: bold;">where</span> field_kind <span style="color: #268bd2; font-weight: bold;">not</span> <span style="color: #268bd2; font-weight: bold;">like</span> <span style="color: #2aa198;">'io%'</span> <span style="color: #008787; background-color: #262626;">-- only look at int and string</span>
<span style="color: #268bd2; font-weight: bold;">and</span> kind <span style="color: #268bd2; font-weight: bold;">like</span> <span style="color: #2aa198;">'%PodSpec'</span>
<span style="color: #268bd2; font-weight: bold;">and</span> field_path <span style="color: #268bd2; font-weight: bold;">like</span> <span style="color: #2aa198;">'%.%'</span>
<span style="color: #268bd2; font-weight: bold;">limit</span> <span style="color: #d75fd7;">20</span>;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 2:</span> Fields Within PodSpec</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">kind</th>
<th scope="col" class="org-left">field_path</th>
<th scope="col" class="org-left">field_kind</th>
<th scope="col" class="org-left">field_type</th>
<th scope="col" class="org-left">sub_kind</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.command</td>
<td class="org-left">string</td>
<td class="org-left">array</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.terminationMessagePath</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.tty</td>
<td class="org-left">integer</td>
<td class="org-left">boolean</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.args</td>
<td class="org-left">string</td>
<td class="org-left">array</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.image</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.stdinOnce</td>
<td class="org-left">integer</td>
<td class="org-left">boolean</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.name</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.workingDir</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.imagePullPolicy</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.terminationMessagePolicy</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">containers.stdin</td>
<td class="org-left">integer</td>
<td class="org-left">boolean</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">initContainers.command</td>
<td class="org-left">string</td>
<td class="org-left">array</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">initContainers.terminationMessagePath</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">initContainers.tty</td>
<td class="org-left">integer</td>
<td class="org-left">boolean</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">initContainers.args</td>
<td class="org-left">string</td>
<td class="org-left">array</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">initContainers.image</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">initContainers.stdinOnce</td>
<td class="org-left">integer</td>
<td class="org-left">boolean</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">initContainers.name</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">initContainers.workingDir</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
<td class="org-left">initContainers.imagePullPolicy</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.Container</td>
</tr>
</tbody>
</table>

<p>
Or we can go in the other direction, and see a sampling of fields that contain podspec.
</p>

<div class="org-src-container">
<pre class="src src-sql-mode" id="org5dbb7cc"><span style="color: #268bd2; font-weight: bold;">select</span> * <span style="color: #268bd2; font-weight: bold;">from</span> kind_field_path
<span style="color: #268bd2; font-weight: bold;">where</span> field_kind <span style="color: #268bd2; font-weight: bold;">not</span> <span style="color: #268bd2; font-weight: bold;">like</span> <span style="color: #2aa198;">'io%'</span> <span style="color: #008787; background-color: #262626;">-- only look at int and string</span>
<span style="color: #268bd2; font-weight: bold;">and</span> sub_kind <span style="color: #268bd2; font-weight: bold;">like</span> <span style="color: #2aa198;">'%PodSpec'</span>
<span style="color: #268bd2; font-weight: bold;">and</span> field_path <span style="color: #268bd2; font-weight: bold;">like</span> <span style="color: #2aa198;">'%.%'</span>
<span style="color: #268bd2; font-weight: bold;">limit</span> <span style="color: #d75fd7;">20</span>;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 3:</span> Fields that Contain Podspec</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">kind</th>
<th scope="col" class="org-left">field_path</th>
<th scope="col" class="org-left">field_kind</th>
<th scope="col" class="org-left">field_type</th>
<th scope="col" class="org-left">sub_kind</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.hostPID</td>
<td class="org-left">integer</td>
<td class="org-left">boolean</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.hostIPC</td>
<td class="org-left">integer</td>
<td class="org-left">boolean</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.hostname</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.nodeName</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.overhead</td>
<td class="org-left">integer</td>
<td class="org-left">object</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.priority</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.dnsPolicy</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.subdomain</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.hostNetwork</td>
<td class="org-left">integer</td>
<td class="org-left">boolean</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.nodeSelector</td>
<td class="org-left">integer</td>
<td class="org-left">object</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.restartPolicy</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.schedulerName</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.serviceAccount</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.preemptionPolicy</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.runtimeClassName</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.priorityClassName</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.enableServiceLinks</td>
<td class="org-left">integer</td>
<td class="org-left">boolean</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.serviceAccountName</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.activeDeadlineSeconds</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.PodTemplateSpec</td>
<td class="org-left">spec.shareProcessNamespace</td>
<td class="org-left">integer</td>
<td class="org-left">boolean</td>
<td class="org-left">io.k8s.api.core.v1.PodSpec</td>
</tr>
</tbody>
</table>
</div>
</div>
