org/reports/2019-08-19_update.org
** A sampling of  subresources for Container
   
   Our initial summary made us curious to see all the sub-resources for any of the fields of podspec.  Here is a sampling for container.
   
  #+NAME: Sub-Resources for Container
 #+BEGIN_SRC sql-mode :exports both :eval never-export
  select * from kind_field_path
  where field_kind not like 'io%' -- only look at int and string
  and kind like '%v1.Container'
  and field_path like '%.%'
  limit 20;
  #+END_SRC

  #+Caption: Sub-resources for the kind Container
 | kind                         | field_path                          | field_kind   | field_type   | sub_kind                                  |
 |--------------------------- - + ----------------------------------- + ------------ + ------------ + ----------------------------------------- +
 | io.k8s.api.core.v1.Container | ports.name                          | string       | string       | io.k8s.api.core.v1.ContainerPort          |
 | io.k8s.api.core.v1.Container | ports.hostIP                        | string       | string       | io.k8s.api.core.v1.ContainerPort          |
 | io.k8s.api.core.v1.Container | ports.hostPort                      | integer      | integer      | io.k8s.api.core.v1.ContainerPort          |
 | io.k8s.api.core.v1.Container | ports.protocol                      | string       | string       | io.k8s.api.core.v1.ContainerPort          |
 | io.k8s.api.core.v1.Container | ports.containerPort                 | integer      | integer      | io.k8s.api.core.v1.ContainerPort          |
 | io.k8s.api.core.v1.Container | envFrom.prefix                      | string       | string       | io.k8s.api.core.v1.EnvFromSource          |
 | io.k8s.api.core.v1.Container | env.value                           | string       | string       | io.k8s.api.core.v1.EnvVar                 |
 | io.k8s.api.core.v1.Container | env.name                            | string       | string       | io.k8s.api.core.v1.EnvVar                 |
 | io.k8s.api.core.v1.Container | readinessProbe.successThreshold     | integer      | integer      | io.k8s.api.core.v1.Probe                  |
 | io.k8s.api.core.v1.Container | readinessProbe.periodSeconds        | integer      | integer      | io.k8s.api.core.v1.Probe                  |
 | io.k8s.api.core.v1.Container | readinessProbe.initialDelaySeconds  | integer      | integer      | io.k8s.api.core.v1.Probe                  |
 | io.k8s.api.core.v1.Container | readinessProbe.timeoutSeconds       | integer      | integer      | io.k8s.api.core.v1.Probe                  |
 | io.k8s.api.core.v1.Container | readinessProbe.failureThreshold     | integer      | integer      | io.k8s.api.core.v1.Probe                  |
 | io.k8s.api.core.v1.Container | livenessProbe.successThreshold      | integer      | integer      | io.k8s.api.core.v1.Probe                  |
 | io.k8s.api.core.v1.Container | livenessProbe.periodSeconds         | integer      | integer      | io.k8s.api.core.v1.Probe                  |
 | io.k8s.api.core.v1.Container | livenessProbe.initialDelaySeconds   | integer      | integer      | io.k8s.api.core.v1.Probe                  |
 | io.k8s.api.core.v1.Container | livenessProbe.timeoutSeconds        | integer      | integer      | io.k8s.api.core.v1.Probe                  |
 | io.k8s.api.core.v1.Container | livenessProbe.failureThreshold      | integer      | integer      | io.k8s.api.core.v1.Probe                  |
 | io.k8s.api.core.v1.Container | resources.limits                    | integer      | object       | io.k8s.api.core.v1.ResourceRequirements   |
 | io.k8s.api.core.v1.Container | resources.requests                  | integer      | object       | io.k8s.api.core.v1.ResourceRequirements   |

