www/2019-08-19_update.html

<div id="outline-container-org201e8b2" class="outline-3">
<h3 id="org201e8b2">A sampling of  subresources for Container</h3>
<div class="outline-text-3" id="text-org201e8b2">
<p>
Our initial summary made us curious to see all the sub-resources for any of the fields of podspec.  Here is a sampling for container.
</p>

<div class="org-src-container">
<pre class="src src-sql-mode" id="orgae8c8df"><span style="color: #268bd2; font-weight: bold;">select</span> * <span style="color: #268bd2; font-weight: bold;">from</span> kind_field_path
<span style="color: #268bd2; font-weight: bold;">where</span> field_kind <span style="color: #268bd2; font-weight: bold;">not</span> <span style="color: #268bd2; font-weight: bold;">like</span> <span style="color: #2aa198;">'io%'</span> <span style="color: #008787; background-color: #262626;">-- only look at int and string</span>
<span style="color: #268bd2; font-weight: bold;">and</span> kind <span style="color: #268bd2; font-weight: bold;">like</span> <span style="color: #2aa198;">'%v1.Container'</span>
<span style="color: #268bd2; font-weight: bold;">and</span> field_path <span style="color: #268bd2; font-weight: bold;">like</span> <span style="color: #2aa198;">'%.%'</span>
<span style="color: #268bd2; font-weight: bold;">limit</span> <span style="color: #d75fd7;">20</span>;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 4:</span> Sub-resources for the kind Container</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">kind</th>
<th scope="col" class="org-left">field_path</th>
<th scope="col" class="org-left">field_kind</th>
<th scope="col" class="org-left">field_type</th>
<th scope="col" class="org-left">sub_kind</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">ports.name</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.ContainerPort</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">ports.hostIP</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.ContainerPort</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">ports.hostPort</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.ContainerPort</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">ports.protocol</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.ContainerPort</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">ports.containerPort</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.ContainerPort</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">envFrom.prefix</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.EnvFromSource</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">env.value</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.EnvVar</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">env.name</td>
<td class="org-left">string</td>
<td class="org-left">string</td>
<td class="org-left">io.k8s.api.core.v1.EnvVar</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">readinessProbe.successThreshold</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.Probe</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">readinessProbe.periodSeconds</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.Probe</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">readinessProbe.initialDelaySeconds</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.Probe</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">readinessProbe.timeoutSeconds</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.Probe</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">readinessProbe.failureThreshold</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.Probe</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">livenessProbe.successThreshold</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.Probe</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">livenessProbe.periodSeconds</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.Probe</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">livenessProbe.initialDelaySeconds</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.Probe</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">livenessProbe.timeoutSeconds</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.Probe</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">livenessProbe.failureThreshold</td>
<td class="org-left">integer</td>
<td class="org-left">integer</td>
<td class="org-left">io.k8s.api.core.v1.Probe</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">resources.limits</td>
<td class="org-left">integer</td>
<td class="org-left">object</td>
<td class="org-left">io.k8s.api.core.v1.ResourceRequirements</td>
</tr>

<tr>
<td class="org-left">io.k8s.api.core.v1.Container</td>
<td class="org-left">resources.requests</td>
<td class="org-left">integer</td>
<td class="org-left">object</td>
<td class="org-left">io.k8s.api.core.v1.ResourceRequirements</td>
</tr>
</tbody>
</table>
</div>
</div>
