org/reports/2019-08-19_update.org
** PodSec - Completely Untested Fields 
This led us to identifying the following completely untested fields:

#+CAPTION: Completely Untested Fields in PodSpec
| podspec_field             | other | e2e_hit | conf_hit /  note |         |
|---------------------------+-------+---------+------------------+---------|
| ephemeralContainers       |     0 |       0 |                0 | include |
| topologySpreadConstraints |     0 |       0 |                0 | include |
| overhead                  |     0 |       0 |                0 | alpha   |
| preemptionPolicy          |     0 |       0 |                0 | alpha   |
| shareProcessNamespace     |     0 |       0 |                0 | beta    |


It was noted that some of these fields were alpha/beta, deprecated or hidden behind FeatureGates according to the description in the documentation, so we created new columns for easy of identification.


#+CAPTION: Field Path with Extended Columns
| field_path            | field_kind | release | deprecated | gated |
|-----------------------+------------+---------+------------+-------|
| overhead              | integer    | alpha   | f          | t     |
| preemptionPolicy      | string     | alpha   | f          | t     |
| shareProcessNamespace | integer    | beta    | f          | f     |
| runtimeClassName      | string     | beta    | f          | f     |
| serviceAccount        | string     | ga      | t          | f     |

* Recommended Actions and Next Steps
  As we built out these views, we were able to notice areas of improvement, which led us to make the following recommendations.
** Update Conformance Tests to use “serviceAccountName” instead of “serviceAccount”
   =serviceAccount= is deprecated, yet we hit it nearly 200 times during our conformance testing.

#+CAPTION: Number of Hits on deprecated serviceAccount
| podspec_field  | other_hits | e2e_hits | conf_hits |
|----------------+------------+----------+-----------|
| serviceAccount |      12025 |     1199 |       201 |

We should update these tests to use =serviceAccountName= instead.

** Prioritize writing test for ephemeralContainers and topologySpreadConstraints


=emphemeralContainers= and =topologySpreadConstraints= are the only GA, ungated PodSpec fields that are completely untested.

#+CAPTION: Number of Hits on GA, Ungated Podspec Fields
| podspec_field             | other_hits | e2e_hits | conf_hits |
|---------------------------+------------+----------+-----------|
| ephemeralContainers       |          0 |        0 |         0 |
| topologySpreadConstraints |          0 |        0 |         0 |
| readinessGates            |          0 |        8 |         0 |
| priorityClassName         |       3731 |       32 |         0 |
| hostIPC                   |          0 |       16 |         0 |
| hostPID                   |          0 |       16 |         0 |

We suggest we prioritize writing conformance tests for those two first, then the reamining four fields that don't have a recognizable test.

** Promote Tests

There are three podSpec fields not hit by any conformance tests.

#+CAPTION: Podspec Fields not hit by conformance tests
| podspec_field    | other_hits | e2e_hits | conf_hits |
|------------------+------------+----------+-----------|
| affinity         |       1213 |       43 |         0 |
| dnsConfig        |          0 |       16 |         0 |
| runtimeClassName |          0 |       36 |         0 |

However, these fields _are_ directly hit by other tests.

#+CAPTION: Tests that Hit non-conformance-tested Podspec Fields
| podspec_field    | test                                                                                                  |
|------------------+-------------------------------------------------------------------------------------------------------|
| affinity         | [k8s.io] [sig-node] AppArmor load AppArmor profiles can disable an AppArmor profile, using unconfined |
| affinity         | [k8s.io] [sig-node] AppArmor load AppArmor profiles should enforce an AppArmor profile                |
| dnsConfig        | [sig-network] DNS should support configurable pod DNS nameservers                                     |
| dnsConfig        | [sig-network] DNS should support configurable pod resolv.conf                                         |
| runtimeClassName | [sig-node] RuntimeClass should reject a Pod requesting a deleted RuntimeClass                         |
| runtimeClassName | [sig-node] RuntimeClass should reject a Pod requesting a non-existent RuntimeClass                    |
| runtimeClassName | [sig-node] RuntimeClass should reject a Pod requesting a RuntimeClass with an unconfigured handler    |

We recommend looking into and preparing these tests for promotion. 

* PodSpec foo

