www/2019-08-19_update.html

<div id="outline-container-orga1b2e57" class="outline-3">
<h3 id="orga1b2e57">PodSec - Completely Untested Fields</h3>
<div class="outline-text-3" id="text-orga1b2e57">
<p>
This led us to identifying the following completely untested fields:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 5:</span> Completely Untested Fields in PodSpec</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">podspec_field</th>
<th scope="col" class="org-right">other</th>
<th scope="col" class="org-right">e2e_hit</th>
<th scope="col" class="org-right">conf_hit /  note</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ephemeralContainers</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-left">include</td>
</tr>

<tr>
<td class="org-left">topologySpreadConstraints</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-left">include</td>
</tr>

<tr>
<td class="org-left">overhead</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-left">alpha</td>
</tr>

<tr>
<td class="org-left">preemptionPolicy</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-left">alpha</td>
</tr>

<tr>
<td class="org-left">shareProcessNamespace</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-left">beta</td>
</tr>
</tbody>
</table>


<p>
It was noted that some of these fields were alpha/beta, deprecated or hidden behind FeatureGates according to the description in the documentation, so we created new columns for easy of identification.
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 6:</span> Field Path with Extended Columns</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">field_path</th>
<th scope="col" class="org-left">field_kind</th>
<th scope="col" class="org-left">release</th>
<th scope="col" class="org-left">deprecated</th>
<th scope="col" class="org-left">gated</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">overhead</td>
<td class="org-left">integer</td>
<td class="org-left">alpha</td>
<td class="org-left">f</td>
<td class="org-left">t</td>
</tr>

<tr>
<td class="org-left">preemptionPolicy</td>
<td class="org-left">string</td>
<td class="org-left">alpha</td>
<td class="org-left">f</td>
<td class="org-left">t</td>
</tr>

<tr>
<td class="org-left">shareProcessNamespace</td>
<td class="org-left">integer</td>
<td class="org-left">beta</td>
<td class="org-left">f</td>
<td class="org-left">f</td>
</tr>

<tr>
<td class="org-left">runtimeClassName</td>
<td class="org-left">string</td>
<td class="org-left">beta</td>
<td class="org-left">f</td>
<td class="org-left">f</td>
</tr>

<tr>
<td class="org-left">serviceAccount</td>
<td class="org-left">string</td>
<td class="org-left">ga</td>
<td class="org-left">t</td>
<td class="org-left">f</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org3370291" class="outline-2">
<h2 id="org3370291">Recommended Actions and Next Steps</h2>
<div class="outline-text-2" id="text-org3370291">
<p>
As we built out these views, we were able to notice areas of improvement, which led us to make the following recommendations.
</p>
</div>
<div id="outline-container-orgb017422" class="outline-3">
<h3 id="orgb017422">Update Conformance Tests to use “serviceAccountName” instead of “serviceAccount”</h3>
<div class="outline-text-3" id="text-orgb017422">
<p>
<code>serviceAccount</code> is deprecated, yet we hit it nearly 200 times during our conformance testing.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 7:</span> Number of Hits on deprecated serviceAccount</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">podspec_field</th>
<th scope="col" class="org-right">other_hits</th>
<th scope="col" class="org-right">e2e_hits</th>
<th scope="col" class="org-right">conf_hits</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">serviceAccount</td>
<td class="org-right">12025</td>
<td class="org-right">1199</td>
<td class="org-right">201</td>
</tr>
</tbody>
</table>

<p>
We should update these tests to use <code>serviceAccountName</code> instead.
</p>
</div>
</div>

<div id="outline-container-org23257aa" class="outline-3">
<h3 id="org23257aa">Prioritize writing test for ephemeralContainers and topologySpreadConstraints</h3>
<div class="outline-text-3" id="text-org23257aa">
<p>
<code>emphemeralContainers</code> and <code>topologySpreadConstraints</code> are the only GA, ungated PodSpec fields that are completely untested.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 8:</span> Number of Hits on GA, Ungated Podspec Fields</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">podspec_field</th>
<th scope="col" class="org-right">other_hits</th>
<th scope="col" class="org-right">e2e_hits</th>
<th scope="col" class="org-right">conf_hits</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ephemeralContainers</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">topologySpreadConstraints</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">readinessGates</td>
<td class="org-right">0</td>
<td class="org-right">8</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">priorityClassName</td>
<td class="org-right">3731</td>
<td class="org-right">32</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">hostIPC</td>
<td class="org-right">0</td>
<td class="org-right">16</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">hostPID</td>
<td class="org-right">0</td>
<td class="org-right">16</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<p>
We suggest we prioritize writing conformance tests for those two first, then the reamining four fields that don&rsquo;t have a recognizable test.
</p>
</div>
</div>

<div id="outline-container-org833ba25" class="outline-3">
<h3 id="org833ba25">Promote Tests</h3>
<div class="outline-text-3" id="text-org833ba25">
<p>
There are three podSpec fields not hit by any conformance tests.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 9:</span> Podspec Fields not hit by conformance tests</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">podspec_field</th>
<th scope="col" class="org-right">other_hits</th>
<th scope="col" class="org-right">e2e_hits</th>
<th scope="col" class="org-right">conf_hits</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">affinity</td>
<td class="org-right">1213</td>
<td class="org-right">43</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">dnsConfig</td>
<td class="org-right">0</td>
<td class="org-right">16</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">runtimeClassName</td>
<td class="org-right">0</td>
<td class="org-right">36</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<p>
However, these fields <span class="underline">are</span> directly hit by other tests.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption class="t-above"><span class="table-number">Table 10:</span> Tests that Hit non-conformance-tested Podspec Fields</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">podspec_field</th>
<th scope="col" class="org-left">test</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">affinity</td>
<td class="org-left">[k8s.io] [sig-node] AppArmor load AppArmor profiles can disable an AppArmor profile, using unconfined</td>
</tr>

<tr>
<td class="org-left">affinity</td>
<td class="org-left">[k8s.io] [sig-node] AppArmor load AppArmor profiles should enforce an AppArmor profile</td>
</tr>

<tr>
<td class="org-left">dnsConfig</td>
<td class="org-left">[sig-network] DNS should support configurable pod DNS nameservers</td>
</tr>

<tr>
<td class="org-left">dnsConfig</td>
<td class="org-left">[sig-network] DNS should support configurable pod resolv.conf</td>
</tr>

<tr>
<td class="org-left">runtimeClassName</td>
<td class="org-left">[sig-node] RuntimeClass should reject a Pod requesting a deleted RuntimeClass</td>
</tr>

<tr>
<td class="org-left">runtimeClassName</td>
<td class="org-left">[sig-node] RuntimeClass should reject a Pod requesting a non-existent RuntimeClass</td>
</tr>

<tr>
<td class="org-left">runtimeClassName</td>
<td class="org-left">[sig-node] RuntimeClass should reject a Pod requesting a RuntimeClass with an unconfigured handler</td>
</tr>
</tbody>
</table>

<p>
We recommend looking into and preparing these tests for promotion. 
</p>
</div>
</div>
</div>
</div>
</body>
</html>
